{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/da7c4dfe-a706-4622-8a2f-26ea54f43abe')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/da7c4dfe-a706-4622-8a2f-26ea54f43abe')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "AppLocker Bypass",
                "description": "",
                "severity": "High",
                "enabled": false,
                "query": "SecurityAlert\n| where AlertSeverity == \"High\" and AlertName contains \"bypass\" and ProviderName == \"Azure Security Center\"\n| extend HostCustomEntity = tostring(parse_json(Entities)[0].HostName)\n\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "Execution"
                ],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Host"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "HostCustomEntity"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        },
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/da7c4dfe-a706-4622-8a2f-26ea54f43abe/actions/85c86934b31042699632b9ab5b77c2f2')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/da7c4dfe-a706-4622-8a2f-26ea54f43abe/85c86934b31042699632b9ab5b77c2f2')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules/actions",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/da7c4dfe-a706-4622-8a2f-26ea54f43abe')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/f2f008f0-6459-463c-86b1-44e934db7dff/resourceGroups/RG-Sent/providers/Microsoft.Logic/workflows/IsolateVM','/triggers/When_a_response_to_an_Azure_Sentinel_alert_is_triggered'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/f2f008f0-6459-463c-86b1-44e934db7dff/resourceGroups/RG-Sent/providers/Microsoft.Logic/workflows/IsolateVM",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/da7c4dfe-a706-4622-8a2f-26ea54f43abe')]"
            ]
        }
    ]
}