{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/57e36a92-99d9-459f-9c19-f8578ff13e89')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/57e36a92-99d9-459f-9c19-f8578ff13e89')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "Resource Group Created",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "AzureActivity\n| where OperationNameValue == \"MICROSOFT.RESOURCES/SUBSCRIPTIONS/RESOURCEGROUPS/WRITE\"\n| where ActivitySubstatusValue == \"Created\"",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT15M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "ResourceDevelopment"
                ],
                "techniques": [
                    "T1587"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": [
                            "ResourceGroup"
                        ]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "Resource Group:{{ResourceGroup}} was created in Subscription:{{SubscriptionId}} at {{TimeGenerated}}",
                    "alertDescriptionFormat": "{{Caller}} created a Resource Group {{ResourceGroup}} in Subscription {{SubscriptionId}}"
                },
                "customDetails": {
                    "ResourceGroup": "ResourceGroup"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Caller"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": [
                    {
                        "columnName": "ResourceGroup"
                    }
                ]
            }
        }
    ]
}