{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dc93bbeb-5f03-4a82-b514-769e4338ac45')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dc93bbeb-5f03-4a82-b514-769e4338ac45')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "Resource Group Deleted",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "AzureActivity\n| where OperationNameValue == \"MICROSOFT.RESOURCES/SUBSCRIPTIONS/RESOURCEGROUPS/DELETE\"\n| extend message_ = tostring(parse_json(Properties).message)\n| where ActivityStatusValue == \"Success\"\n\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT15M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "ResourceDevelopment"
                ],
                "techniques": [
                    "T1584"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": [
                            "ResourceGroup"
                        ]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "Resource Group {{ResourceGroup}} was deleted",
                    "alertDescriptionFormat": "Resource Group {{ResourceGroup}} was deleted by {{Caller}} at {{TimeGenerated}}"
                },
                "customDetails": {
                    "ResourceGroup": "ResourceGroup"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Caller"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}